[
  {"id":"AlleAlon08","accessed":{"date-parts":[[2020,2,18]]},"author":[{"family":"Allesina","given":"S."},{"family":"Alonso","given":"D."},{"family":"Pascual","given":"M."}],"container-title":"Science","container-title-short":"Science","DOI":"10.1126/science.1156269","ISSN":"0036-8075, 1095-9203","issue":"5876","issued":{"date-parts":[[2008,5,2]]},"language":"en","page":"658-661","source":"DOI.org (Crossref)","title":"A General Model for Food Web Structure","type":"article-journal","URL":"https://www.sciencemag.org/lookup/doi/10.1126/science.1156269","volume":"320"},
  {"id":"AlleTang12","abstract":"Analysis of stability criteria for different types of complex ecological network shows key differences between predator–prey interactions, which are stabilizing, and competitive and mutualistic interactions, which are destabilizing.","accessed":{"date-parts":[[2020,2,10]]},"author":[{"family":"Allesina","given":"Stefano"},{"family":"Tang","given":"Si"}],"container-title":"Nature","DOI":"10.1038/nature10832","ISSN":"1476-4687","issue":"7388","issued":{"date-parts":[[2012,3]]},"language":"en","page":"205-208","source":"www.nature.com","title":"Stability criteria for complex ecosystems","type":"article-journal","URL":"https://www.nature.com/articles/nature10832","volume":"483"},
  {"id":"AlleTang15","abstract":"Since the work of Robert May in 1972, the local asymptotic stability of large ecological systems has been a focus of theoretical ecology. Here we review May’s work in the light of random matrix theory, the field of mathematics devoted to the study of large matrices whose coefficients are randomly sampled from distributions with given characteristics. We show how May’s celebrated “stability criterion” can be derived using random matrix theory, and how extensions of the so-called circular law for the limiting distribution of the eigenvalues of large random matrix can further our understanding of ecological systems. Our goal is to present the more technical material in an accessible way, and to provide pointers to the primary mathematical literature on this subject. We conclude by enumerating a number of challenges, whose solution is going to greatly improve our ability to predict the stability of large ecological networks.","accessed":{"date-parts":[[2017,4,21]]},"author":[{"family":"Allesina","given":"Stefano"},{"family":"Tang","given":"Si"}],"container-title":"Population Ecology","container-title-short":"Popul Ecol","DOI":"10.1007/s10144-014-0471-0","ISSN":"1438-3896, 1438-390X","issue":"1","issued":{"date-parts":[[2015,1,1]]},"language":"en","page":"63-75","source":"link.springer.com","title":"The stability–complexity relationship at age 40: a random matrix perspective","title-short":"The stability–complexity relationship at age 40","type":"article-journal","URL":"https://link.springer.com/article/10.1007/s10144-014-0471-0","volume":"57"},
  {"id":"Anon15","accessed":{"date-parts":[[2020,2,12]]},"ISBN":"978-0-691-15928-7","issued":{"literal":"Tue, 08/04/2015 - 12:00"},"language":"en","source":"press.princeton.edu","title":"Bayesian Models","type":"book","URL":"https://press.princeton.edu/books/hardcover/9780691159287/bayesian-models"},
  {"id":"BaisGrav19","abstract":"Aim How do factors such as space, time, climate and other ecological drivers influence food web structure and dynamics? Collections of well-studied food webs and replicate food webs from the same system that span biogeographical and ecological gradients now enable detailed, quantitative investigation of such questions and help integrate food web ecology and macroecology. Here, we integrate macroecology and food web ecology by focusing on how ecogeographical rules [the latitudinal diversity gradient (LDG), Bergmann's rule, the island rule and Rapoport's rule] are associated with the architecture of food webs. Location Global. Time period Current. Major taxa studied All taxa. Methods We discuss the implications of each ecogeographical rule for food webs, present predictions for how food web structure will vary with each rule, assess empirical support where available, and discuss how food webs may influence ecogeographical rules. Finally, we recommend systems and approaches for further advancing this research agenda. Results We derived testable predictions for some ecogeographical rules (e.g. LDG, Rapoport's rule), while for others (e.g., Bergmann's and island rules) it is less clear how we would expect food webs to change over macroecological scales. Based on the LDG, we found weak support for both positive and negative relationships between food chain length and latitude and for increased generality and linkage density at higher latitudes. Based on Rapoport's rule, we found support for the prediction that species turnover in food webs is inversely related to latitude. Main conclusions The macroecology of food webs goes beyond traditional approaches to biodiversity at macroecological scales by focusing on trophic interactions among species. The collection of food web data for different types of ecosystems across biogeographical gradients is key to advance this research agenda. Further, considering food web interactions as a selection pressure that drives or disrupts ecogeographical rules has the potential to address both mechanisms of and deviations from these macroecological relationships. For these reasons, further integration of macroecology and food webs will help ecologists better understand the assembly, maintenance and change of ecosystems across space and time.","accessed":{"date-parts":[[2019,5,21]]},"author":[{"family":"Baiser","given":"Benjamin"},{"family":"Gravel","given":"Dominique"},{"family":"Cirtwill","given":"Alyssa R."},{"family":"Dunne","given":"Jennifer A."},{"family":"Fahimipour","given":"Ashkaan K."},{"family":"Gilarranz","given":"Luis J."},{"family":"Grochow","given":"Joshua A."},{"family":"Li","given":"Daijiang"},{"family":"Martinez","given":"Neo D."},{"family":"McGrew","given":"Alicia"},{"family":"Poisot","given":"Timothée"},{"family":"Romanuk","given":"Tamara N."},{"family":"Stouffer","given":"Daniel B."},{"family":"Trotta","given":"Lauren B."},{"family":"Valdovinos","given":"Fernanda S."},{"family":"Williams","given":"Richard J."},{"family":"Wood","given":"Spencer A."},{"family":"Yeakel","given":"Justin D."}],"container-title":"Global Ecology and Biogeography","DOI":"10.1111/geb.12925","ISSN":"1466-8238","issue":"0","issued":{"date-parts":[[2019]]},"language":"en","source":"Wiley Online Library","title":"Ecogeographical rules and the macroecology of food webs","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1111/geb.12925","volume":"0"},
  {"id":"BaisRuss10","abstract":"Human induced global change has greatly altered the structure and composition of food webs through the invasion of non-native species and the extinction of native species. Much attention has been paid to the effects of species deletions on food web structure and stability. However, recent empirical evidence suggests that for most taxa local species richness has increased as successful invasions outpace extinctions at this scale. This pattern suggests that food webs, which represent feeding interactions at the local scale, may be increasing in species richness. Knowledge of how food web structure relates to invasive species establishment and the effect of successful invaders on subsequent food web structure remains an unknown but potentially important aspect of global change. Here we explore the effect of food web topology on invasion success in model food webs to develop hypotheses about how the distribution of biodiversity across trophic levels affects the success of invasion at each trophic level. Our results suggest a connectance (C) based framework for predicting invasion success in food webs due to the way that C constrains the number of species at each trophic level and thus the number of potential predators and prey for an invader at a given trophic level. We use the relationship between C and the proportion of species at each trophic level in 14 well studied food webs to make the following predictions; 1) the success of basal invaders will increase as C increases due to the decrease in herbivores in high C webs, 2) herbivore invasion success will decrease as C increases due to the decrease in the proportion of basal species and increase in intermediate species and omnivores in high C webs. 3) Top predator invasion success will increase as C increases due to the increase in intermediate prey species. However, it is not clear how the relative influence of trophic structure compares to empirically known predictors of invasion success such as invader traits, propagule pressure, and resource availability.","accessed":{"date-parts":[[2017,9,29]]},"author":[{"family":"Baiser","given":"Benjamin"},{"family":"Russell","given":"Gareth J."},{"family":"Lockwood","given":"Julie L."}],"container-title":"Oikos","container-title-short":"Oikos","DOI":"10.1111/j.1600-0706.2010.18557.x","ISSN":"1600-0706","issue":"12","issued":{"date-parts":[[2010,12,1]]},"language":"en","page":"1970-1976","source":"Wiley Online Library","title":"Connectance determines invasion success via trophic interactions in model food webs","type":"article-journal","URL":"http://onlinelibrary.wiley.com/doi/10.1111/j.1600-0706.2010.18557.x/abstract","volume":"119"},
  {"id":"BascJord03","abstract":"Most studies of plant–animal mutualisms involve a small number of species. There is almost no information on the structural organization of species-rich mutualistic networks despite its potential importance for the maintenance of diversity. Here we analyze 52 mutualistic networks and show that they are highly nested; that is, the more specialist species interact only with proper subsets of those species interacting with the more generalists. This assembly pattern generates highly asymmetrical interactions and organizes the community cohesively around a central core of interactions. Thus, mutualistic networks are neither randomly assembled nor organized in compartments arising from tight, parallel specialization. Furthermore, nestedness increases with the complexity (number of interactions) of the network: for a given number of species, communities with more interactions are significantly more nested. Our results indicate a nonrandom pattern of community organization that may be relevant for our understanding of the organization and persistence of biodiversity.","accessed":{"date-parts":[[2016,10,12]]},"author":[{"family":"Bascompte","given":"J."},{"family":"Jordano","given":"P."},{"family":"Melian","given":"C. J."},{"family":"Olesen","given":"J. M."}],"container-title":"Proceedings of the National Academy of Sciences","container-title-short":"PNAS","DOI":"10.1073/pnas.1633576100","ISSN":"0027-8424, 1091-6490","issue":"16","issued":{"date-parts":[[2003,8,5]]},"language":"en","page":"9383-9387","source":"CrossRef","title":"The nested assembly of plant-animal mutualistic networks","type":"article-journal","URL":"http://www.pnas.org/cgi/doi/10.1073/pnas.1633576100","volume":"100"},
  {"id":"BeckPetc06","abstract":"Food webs, the networks of feeding links between species, are central to our understanding of ecosystem structure, stability, and function. One of the key aspects of food web structure is complexity, or connectance, the number of links expressed as a proportion of the total possible number of links. Connectance (complexity) is linked to the stability of webs and is a key parameter in recent models of other aspects of web structure. However, there is still no fundamental biological explanation for connectance in food webs. Here, we propose that constraints on diet breadth, driven by optimal foraging, provide such an explanation. We show that a simple diet breadth model predicts highly constrained values of connectance as an emergent consequence of individual foraging behavior. When combined with features of real food web data, such as taxonomic and trophic aggregation and cumulative sampling of diets, the model predicts well the levels of connectance and scaling of connectance with species richness, seen in real food webs. This result is a previously undescribed synthesis of foraging theory and food web theory, in which network properties emerge from the behavior of individuals and, as such, provides a mechanistic explanation of connectance currently lacking in food web models.","accessed":{"date-parts":[[2020,2,18]]},"author":[{"family":"Beckerman","given":"Andrew P."},{"family":"Petchey","given":"Owen L."},{"family":"Warren","given":"Philip H."}],"container-title":"Proceedings of the National Academy of Sciences","container-title-short":"PNAS","DOI":"10.1073/pnas.0603039103","ISSN":"0027-8424, 1091-6490","issue":"37","issued":{"date-parts":[[2006,9,12]]},"language":"en","page":"13745-13749","PMID":"16954193","source":"www.pnas.org","title":"Foraging biology predicts food web complexity","type":"article-journal","URL":"https://www.pnas.org/content/103/37/13745","volume":"103"},
  {"id":"BorrAlle15a","abstract":"Much of the focus in evolutionary biology has been on the adaptive differentiation among organisms. It is equally important to understand the processes that result in similarities of structure among systems. Here, we discuss examples of similarities occurring at different ecological scales, from predator–prey relations (attack rates and handling times) through communities (food-web structures) to ecosystem properties. Selection among systemic configurations or patterns that differ in their intrinsic stability should lead generally to increased representation of relatively stable structures. Such nonadaptive, but selective processes that shape ecological communities offer an enticing mechanism for generating widely observed similarities, and have sparked new interest in stability properties. This nonadaptive systemic selection operates not in opposition to, but in parallel with, adaptive evolution.","accessed":{"date-parts":[[2020,2,12]]},"author":[{"family":"Borrelli","given":"Jonathan J."},{"family":"Allesina","given":"Stefano"},{"family":"Amarasekare","given":"Priyanga"},{"family":"Arditi","given":"Roger"},{"family":"Chase","given":"Ivan"},{"family":"Damuth","given":"John"},{"family":"Holt","given":"Robert D."},{"family":"Logofet","given":"Dmitrii O."},{"family":"Novak","given":"Mark"},{"family":"Rohr","given":"Rudolf P."},{"family":"Rossberg","given":"Axel G."},{"family":"Spencer","given":"Matthew"},{"family":"Tran","given":"J. Khai"},{"family":"Ginzburg","given":"Lev R."}],"container-title":"Trends in Ecology & Evolution","container-title-short":"Trends in Ecology & Evolution","DOI":"10.1016/j.tree.2015.05.001","ISSN":"0169-5347","issue":"7","issued":{"date-parts":[[2015,7,1]]},"language":"en","page":"417-425","source":"ScienceDirect","title":"Selection on stability across ecological scales","type":"article-journal","URL":"http://www.sciencedirect.com/science/article/pii/S0169534715001238","volume":"30"},
  {"id":"BorrMood14","author":[{"family":"Borrett","given":"Stuart R."},{"family":"Moody","given":"James"},{"family":"Edelmann","given":"Achim"}],"container-title":"Ecological Modelling","DOI":"10.1016/j.ecolmodel.2014.02.019","issued":{"date-parts":[[2014,12]]},"page":"111-127","title":"The rise of Network Ecology: Maps of the topic diversity and scientific collaboration","type":"article-journal","volume":"293"},
  {"id":"BrosOstl04","author":[{"family":"Brose","given":"Ulrich"},{"family":"Ostling","given":"Annette"},{"family":"Harrison","given":"Kateri"},{"family":"Martinez","given":"Neo D."}],"container-title":"Nature","DOI":"10.1038/nature02297","issue":"6979","issued":{"date-parts":[[2004]]},"page":"167-171","title":"Unified spatial scaling of species and their trophic interactions","type":"article-journal","URL":"http://dx.doi.org/10.1038/nature02297","volume":"428"},
  {"id":"CanaMouq12","author":[{"family":"Canard","given":"Elsa"},{"family":"Mouquet","given":"Nicolas"},{"family":"Marescot","given":"Lucile"},{"family":"Gaston","given":"Kevin J."},{"family":"Gravel","given":"Dominique"},{"family":"Mouillot","given":"David"}],"container-title":"PLoS ONE","DOI":"10.1371/journal.pone.0038295","issue":"8","issued":{"date-parts":[[2012,8]]},"page":"e38295","title":"Emergence of Structural Patterns in Neutral Trophic Networks","type":"article-journal","volume":"7"},
  {"id":"CarpGelm17","accessed":{"date-parts":[[2019,12,30]]},"author":[{"family":"Carpenter","given":"Bob"},{"family":"Gelman","given":"Andrew"},{"family":"Hoffman","given":"Matthew D."},{"family":"Lee","given":"Daniel"},{"family":"Goodrich","given":"Ben"},{"family":"Betancourt","given":"Michael"},{"family":"Brubaker","given":"Marcus"},{"family":"Guo","given":"Jiqiang"},{"family":"Li","given":"Peter"},{"family":"Riddell","given":"Allen"}],"container-title":"Journal of Statistical Software","DOI":"10.18637/jss.v076.i01","ISSN":"1548-7660","issue":"1","issued":{"date-parts":[[2017,1,11]]},"language":"en","page":"1-32","source":"www.jstatsoft.org","title":"Stan: A Probabilistic Programming Language","title-short":"Stan","type":"article-journal","URL":"https://www.jstatsoft.org/index.php/jss/article/view/v076i01","volume":"76"},
  {"id":"CattBers04","accessed":{"date-parts":[[2020,2,18]]},"author":[{"family":"Cattin","given":"Marie-France"},{"family":"Bersier","given":"Louis-Félix"},{"family":"Banašek-Richter","given":"Carolin"},{"family":"Baltensperger","given":"Richard"},{"family":"Gabriel","given":"Jean-Pierre"}],"container-title":"Nature","container-title-short":"Nature","DOI":"10.1038/nature02327","ISSN":"0028-0836, 1476-4687","issue":"6977","issued":{"date-parts":[[2004,2]]},"language":"en","page":"835-839","source":"DOI.org (Crossref)","title":"Phylogenetic constraints and adaptation explain food-web structure","type":"article-journal","URL":"http://www.nature.com/articles/nature02327","volume":"427"},
  {"id":"Chag15","abstract":"Species interact in nature to form complex ecological networks. There has been a rising interest in recent years to characterize the topology of such networks along various gradients (e.g. successional, climatic, elevational) to better understand how they assemble in space and time. However, to compare structure of networks that vary in size, shape and connectance, topological metrics need to be standardized (as most metrics covary with such network attributes). Traditionally, this has been done by transforming network metrics into z-scores prior comparisons. Here, I show that such standardized metrics are not independent of basic network properties such as connectance. Instead, I found that there was a consistent tendency for z-scores to approach 0 when connectance progressively decreased and approached its minimal value. This is probably due to the reduced null space available for null models to randomize interactions at such low connectance. I discuss ways to circumvent the problem in future studies.","accessed":{"date-parts":[[2020,2,5]]},"author":[{"family":"Chagnon","given":"Pierre-Luc"}],"container-title":"Ecological Complexity","container-title-short":"Ecological Complexity","DOI":"10.1016/j.ecocom.2015.01.004","ISSN":"1476-945X","issued":{"date-parts":[[2015,6,1]]},"language":"en","page":"36-39","source":"ScienceDirect","title":"Characterizing topology of ecological networks along gradients: The limits of metrics’ standardization","title-short":"Characterizing topology of ecological networks along gradients","type":"article-journal","URL":"http://www.sciencedirect.com/science/article/pii/S1476945X15000070","volume":"22"},
  {"id":"CoheBria84","author":[{"family":"Cohen","given":"J. E."},{"family":"Briand","given":"F."}],"container-title":"Proc Natl Acad Sci U S A","issue":"13","issued":{"date-parts":[[1984]]},"page":"4105-4109","title":"Trophic links of community food webs.","type":"article-journal","volume":"81"},
  {"id":"CoheNewm85","abstract":"Three recently discovered quantitative empirical generalizations describe major features of the structure of community food webs. These generalizations are: (i) a species scaling law: the mean proportions of basal, intermediate and top species remain invariant at approximately 0.19, 0.53, and 0.29, respectively, over the range of variation in the number of species in a web; (ii) a link scaling law : the mean proportions of trophic links in the categories basal-intermediate, basal-top, intermediate–intermediate, and intermediate–top remain invariant at approximately 0.27, 0.08, 0.30 and 0.35, respectively, over the range of variation in the number of species in a web; and (iii) a link-species scaling law: the ratio of mean trophic links to species remains invariant at approximately 1.86, over the range of variation in the number of species in a web. This paper presents a model, the only successful one among several attempts, in which the first two of these empirical generalizations can be derived as a consequence of the third. The model assumes that species are ordered in a cascade or hierarchy such that a given species can prey on only those species below it and can be preyed on by only those species above it in the hierarchy.","accessed":{"date-parts":[[2020,2,3]]},"author":[{"family":"Cohen","given":"Joel E."},{"family":"Newman","given":"Charles M."}],"container-title":"Proceedings of the Royal Society of London. Series B. Biological Sciences","container-title-short":"Proc. R. Soc. Lond. B","DOI":"10.1098/rspb.1985.0042","ISSN":"0080-4649, 2053-9193","issue":"1237","issued":{"date-parts":[[1985,6,22]]},"language":"en","page":"421-448","source":"DOI.org (Crossref)","title":"A stochastic theory of community food webs I. Models and aggregated data","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rspb.1985.0042","volume":"224"},
  {"id":"CoheNewm88","accessed":{"date-parts":[[2020,2,3]]},"author":[{"family":"Cohen","given":"Joel E."},{"family":"Newman","given":"Charles M."}],"container-title":"Ecology","DOI":"10.2307/1941142","ISSN":"00129658","issue":"6","issued":{"date-parts":[[1988,12]]},"language":"en","page":"1655-1664","source":"DOI.org (Crossref)","title":"Dynamic Basis of Food Web Organization","type":"article-journal","URL":"http://doi.wiley.com/10.2307/1941142","volume":"69"},
  {"id":"DelmBess18","abstract":"Networks provide one of the best representation for ecological communities, composed of many speecies with dense connections between them. Yet the methodological literature allowing one to analyse and extract meaning from ecological networks is dense, fragmented, and unwelcoming. We provide a general overview to the field, outlining both the intent of the different measures, their assumptions, and the contexts in which they can be used. We anchor this discussion in examples from empirical studies, and conclude by highlighting what we think should be the future developments in the field.","accessed":{"date-parts":[[2018,6,20]]},"author":[{"family":"Delmas","given":"Eva"},{"family":"Besson","given":"Mathilde"},{"family":"Brice","given":"Marie-Hélène"},{"family":"Burkle","given":"Laura A."},{"family":"Dalla Riva","given":"Giulio V."},{"family":"Fortin","given":"Marie-Josée"},{"family":"Gravel","given":"Dominique"},{"family":"Guimarães","given":"Paulo R."},{"family":"Hembry","given":"David H."},{"family":"Newman","given":"Erica A."},{"family":"Olesen","given":"Jens M."},{"family":"Pires","given":"Mathias M."},{"family":"Yeakel","given":"Justin D."},{"family":"Poisot","given":"Timothée"}],"container-title":"Biological Reviews","DOI":"10.1111/brv.12433","ISSN":"14647931","issued":{"date-parts":[[2018,6,20]]},"language":"en","page":"112540","source":"Crossref","title":"Analysing ecological networks of species interactions","title-short":"Analysing ecological networks of species interactions","type":"article-journal","URL":"http://doi.wiley.com/10.1111/brv.12433"},
  {"id":"Deng09","abstract":"Aim The aims of this study are to resolve terminological confusion around different types of species–area relationships (SARs) and their delimitation from species sampling relationships (SSRs), to provide a comprehensive overview of models and analytical methods for SARs, to evaluate these theoretically and empirically, and to suggest a more consistent approach for the treatment of species–area data. Location Curonian Spit in north-west Russia and archipelagos world-wide. Methods First, I review various typologies for SARs and SSRs as well as mathematical models, fitting procedures and goodness-of-fit measures applied to SARs. This results in a list of 23 function types, which are applicable both for untransformed (S) and for log-transformed (log S) species richness. Then, example data sets for nested plots in continuous vegetation (n = 14) and islands (n = 6) are fitted to a selection of 12 function types (linear, power, logarithmic, saturation, sigmoid) both for S and for log S. The suitability of these models is assessed with Akaike’s information criterion for S and log S, and with a newly proposed metric that addresses extrapolation capability. Results SARs, which provide species numbers for different areas and have no upper asymptote, must be distinguished from SSRs, which approach the species richness of one single area asymptotically. Among SARs, nested plots in continuous ecosystems, non-nested plots in continuous ecosystems, and isolates can be distinguished. For the SARs of the empirical data sets, the normal and quadratic power functions as well as two of the sigmoid functions (Lomolino, cumulative beta-P) generally performed well. The normal power function (fitted for S) was particularly suitable for predicting richness values over ten-fold increases in area. Linear, logarithmic, convex saturation and logistic functions generally were inappropriate. However, the two sigmoid models produced unstable results with arbitrary parameter estimates, and the quadratic power function resulted in decreasing richness values for large areas. Main conclusions Based on theoretical considerations and empirical results, I suggest that the power law should be used to describe and compare any type of SAR while at the same time testing whether the exponent z changes with spatial scale. In addition, one should be aware that power-law parameters are significantly influenced by methodology.","accessed":{"date-parts":[[2020,2,10]]},"author":[{"family":"Dengler","given":"Jürgen"}],"container-title":"Journal of Biogeography","DOI":"10.1111/j.1365-2699.2008.02038.x","ISSN":"1365-2699","issue":"4","issued":{"date-parts":[[2009]]},"language":"en","page":"728-744","source":"Wiley Online Library","title":"Which function describes the species–area relationship best? A review and empirical evaluation","title-short":"Which function describes the species–area relationship best?","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1365-2699.2008.02038.x","volume":"36"},
  {"id":"DoumWeed19","abstract":"Abstract Proportional data, in which response variables are expressed as percentages or fractions of a whole, are analysed in many subfields of ecology and evolution. The scale-independence of proportions makes them appropriate to analyse many biological phenomena, but statistical analyses are not straightforward, since proportions can only take values from zero to one and their variance is usually not constant across the range of the predictor. Transformations to overcome these problems are often applied, but can lead to biased estimates and difficulties in interpretation. In this paper, we provide an overview of the different types of proportional data and discuss the different analysis strategies available. In particular, we review and discuss the use of promising, but little used, techniques for analysing continuous (also called non-count-based or non-binomial) proportions (e.g. percent cover, fraction time spent on an activity): beta and Dirichlet regression, and some of their most important extensions. A major distinction can be made between proportions arising from counts and those arising from continuous measurements. For proportions consisting of two categories, count-based data are best analysed using well-developed techniques such as logistic regression, while continuous proportions can be analysed with beta regression models. In the case of >2 categories, multinomial logistic regression or Dirichlet regression can be applied. Both beta and Dirichlet regression techniques model proportions at their original scale, which makes statistical inference more straightforward and produce less biased estimates relative to transformation-based solutions. Extensions to beta regression, such as models for variable dispersion, zero-one augmented data and mixed effects designs have been developed and are reviewed and applied to case studies. Finally, we briefly discuss some issues regarding model fitting, inference, and reporting that are particularly relevant to beta and Dirichlet regression. Beta regression and Dirichlet regression overcome some problems inherent in applying classic statistical approaches to proportional data. To facilitate the adoption of these techniques by practitioners in ecology and evolution, we present detailed, annotated demonstration scripts covering all variations of beta and Dirichlet regression discussed in the article, implemented in the freely available language for statistical computing, r.","accessed":{"date-parts":[[2019,11,11]]},"author":[{"family":"Douma","given":"Jacob C."},{"family":"Weedon","given":"James T."}],"container-title":"Methods in Ecology and Evolution","container-title-short":"Methods in Ecology and Evolution","DOI":"10.1111/2041-210X.13234","ISSN":"2041-210X","issue":"9","issued":{"date-parts":[[2019,9,1]]},"page":"1412-1430","source":"besjournals.onlinelibrary.wiley.com (Atypon)","title":"Analysing continuous proportions in ecology and evolution: A practical introduction to beta and Dirichlet regression","title-short":"Analysing continuous proportions in ecology and evolution","type":"article-journal","URL":"https://besjournals.onlinelibrary.wiley.com/doi/full/10.1111/2041-210X.13234","volume":"10"},
  {"id":"DunnWill02","abstract":"Networks from a wide range of physical, biological, and social systems have been recently described as “small-world” and “scale-free.” However, studies disagree whether ecological networks called food webs possess the characteristic path lengths, clustering coefficients, and degree distributions required for membership in these classes of networks. Our analysis suggests that the disagreements are based on selective use of relatively few food webs, as well as analytical decisions that obscure important variability in the data. We analyze a broad range of 16 high-quality food webs, with 25–172 nodes, from a variety of aquatic and terrestrial ecosystems. Food webs generally have much higher complexity, measured as connectance (the fraction of all possible links that are realized in a network), and much smaller size than other networks studied, which have important implications for network topology. Our results resolve prior conflicts by demonstrating that although some food webs have small-world and scale-free structure, most do not if they exceed a relatively low level of connectance. Although food-web degree distributions do not display a universal functional form, observed distributions are systematically related to network connectance and size. Also, although food webs often lack small-world structure because of low clustering, we identify a continuum of real-world networks including food webs whose ratios of observed to random clustering coefficients increase as a power–law function of network size over 7 orders of magnitude. Although food webs are generally not small-world, scale-free networks, food-web topology is consistent with patterns found within those classes of networks.","accessed":{"date-parts":[[2020,2,5]]},"author":[{"family":"Dunne","given":"Jennifer A."},{"family":"Williams","given":"Richard J."},{"family":"Martinez","given":"Neo D."}],"container-title":"Proceedings of the National Academy of Sciences","container-title-short":"PNAS","DOI":"10.1073/pnas.192407699","ISSN":"0027-8424, 1091-6490","issue":"20","issued":{"date-parts":[[2002,10,1]]},"language":"en","page":"12917-12922","PMID":"12235364","source":"www.pnas.org","title":"Food-web structure and network theory: The role of connectance and size","title-short":"Food-web structure and network theory","type":"article-journal","URL":"https://www.pnas.org/content/99/20/12917","volume":"99"},
  {"id":"ForiJenk17","abstract":"Variation in diet breadth among organisms is a pervasive feature of the natural world that has resisted general explanation. In particular, trade-offs in the ability to use one resource at the expense of another have been expected but rarely detected. We explore a spatial model for the evolution of specialization, motivated by studies of plant-feeding insects. The model is neutral with respect to the causes and consequences of diet breadth: the number of hosts utilized is not constrained by trade-offs, and specialization or generalization does not confer a direct advantage with respect to the persistence of populations or the probability of diversification. We find that diet breadth evolves in ways that resemble reports from natural communities. Simulated communities are dominated by specialized species, with a predictable but less species-rich component of generalized taxa. These results raise the possibility that specialization might be a consequence of stochastic diversification dynamics acting on spatially segregated consumer-resource associations rather than a trait either favored or constrained directly by natural selection. Finally, our model generates hypotheses for global patterns of herbivore diet breadth, including a positive effect of host richness and a negative effect of evenness in host plant abundance on the number of specialized taxa.","accessed":{"date-parts":[[2017,7,25]]},"author":[{"family":"Forister","given":"Matthew L."},{"family":"Jenkins","given":"Stephen H."}],"container-title":"The American Naturalist","container-title-short":"The American Naturalist","DOI":"10.1086/692325","ISSN":"0003-0147","issue":"2","issued":{"date-parts":[[2017,5,5]]},"page":"E40-E54","source":"journals.uchicago.edu (Atypon)","title":"A Neutral Model for the Evolution of Diet Breadth","type":"article-journal","URL":"http://www.journals.uchicago.edu/doi/abs/10.1086/692325","volume":"190"},
  {"id":"FortBasc06","accessed":{"date-parts":[[2015,1,21]]},"author":[{"family":"Fortuna","given":"Miguel A."},{"family":"Bascompte","given":"Jordi"}],"container-title":"Ecol. Lett.","DOI":"10.1111/j.1461-0248.2005.00868.x","issue":"3","issued":{"date-parts":[[2006]]},"page":"281-286","title":"Habitat loss and the structure of plantanimal mutualistic networks","type":"article-journal","volume":"9"},
  {"id":"GabrSimp19","abstract":"Bayesian data analysis is not only about computing a posterior distribution, and Bayesian visualization is about more than trace plots of Markov chains. Rather, practical Bayesian data analysis is an iterative process of model building, inference, model checking and evaluation, and model expansion. Visualization is not only helpful in each of these stages of the Bayesian workﬂow, it is indispensable for making inferences from the intricate, high-dimensional models of interest to applied researchers, and essential for understanding and diagnosing the increasingly complex algorithms required to ﬁt such models.","accessed":{"date-parts":[[2019,6,13]]},"author":[{"family":"Gabry","given":"Jonah"},{"family":"Simpson","given":"Daniel"},{"family":"Vehtari","given":"Aki"},{"family":"Betancourt","given":"Michael"},{"family":"Gelman","given":"Andrew"}],"container-title":"Journal of the Royal Statistical Society: Series A (Statistics in Society)","container-title-short":"J. R. Stat. Soc. A","DOI":"10.1111/rssa.12378","ISSN":"09641998","issue":"2","issued":{"date-parts":[[2019,2]]},"language":"en","page":"389-402","source":"arXiv.org","title":"Visualization in Bayesian workflow","type":"article-journal","URL":"http://arxiv.org/abs/1709.01449","volume":"182"},
  {"id":"GaliLurg18","abstract":"How biotic interactions change across spatial scales is not well characterized. Here, the authors outline a theoretical framework to explore the spatial scaling of multitrophic communities, and present testable predictions on network-area relationships (NARs).","accessed":{"date-parts":[[2020,2,9]]},"author":[{"family":"Galiana","given":"Nuria"},{"family":"Lurgi","given":"Miguel"},{"family":"Claramunt-López","given":"Bernat"},{"family":"Fortin","given":"Marie-Josée"},{"family":"Leroux","given":"Shawn"},{"family":"Cazelles","given":"Kevin"},{"family":"Gravel","given":"Dominique"},{"family":"Montoya","given":"José M."}],"container-title":"Nature Ecology & Evolution","DOI":"10.1038/s41559-018-0517-3","ISSN":"2397-334X","issue":"5","issued":{"date-parts":[[2018,5]]},"language":"en","page":"782-790","source":"www.nature.com","title":"The spatial scaling of species interaction networks","type":"article-journal","URL":"https://www.nature.com/articles/s41559-018-0517-3","volume":"2"},
  {"id":"GarlCald03","abstract":"The structure of ecological communities is usually represented by food webs1,2,3. In these webs, we describe species by means of vertices connected by links representing the predations. We can therefore study different webs by considering the shape (topology) of these networks4,5. Comparing food webs by searching for regularities is of fundamental importance, because universal patterns would reveal common principles underlying the organization of different ecosystems. However, features observed in small food webs1,2,3,6 are different from those found in large ones7,8,9,10,11,12,13,14,15. Furthermore, food webs (except in isolated cases16,17) do not share18,19 general features with other types of network (including the Internet, the World Wide Web and biological webs). These features are a small-world character4,5 and a scale-free (power-law) distribution of the degree4,5 (the number of links per vertex). Here we propose to describe food webs as transportation networks20 by extending to them the concept of allometric scaling20,21,22 (how branching properties change with network size). We then decompose food webs in spanning trees and loop-forming links. We show that, whereas the number of loops varies significantly across real webs, spanning trees are characterized by universal scaling relations.","accessed":{"date-parts":[[2020,2,8]]},"author":[{"family":"Garlaschelli","given":"Diego"},{"family":"Caldarelli","given":"Guido"},{"family":"Pietronero","given":"Luciano"}],"container-title":"Nature","DOI":"10.1038/nature01604","ISSN":"1476-4687","issue":"6936","issued":{"date-parts":[[2003,5]]},"language":"en","page":"165-168","source":"www.nature.com","title":"Universal scaling relations in food webs","type":"article-journal","URL":"https://www.nature.com/articles/nature01604","volume":"423"},
  {"id":"HobbHoot15","author":[{"family":"Hobbs","given":"N. Thompson"},{"family":"Hooten","given":"Mevin B."}],"call-number":"QH541.15.S72 H63 2015","ISBN":"978-0-691-15928-7","issued":{"date-parts":[[2015]]},"number-of-pages":"299","publisher":"Princeton University Press","publisher-place":"Princeton, New Jersey","source":"Library of Congress ISBN","title":"Bayesian models: a statistical primer for ecologists","title-short":"Bayesian models","type":"book"},
  {"id":"HoltLawt99","abstract":"The species–area relationship may be the strongest empirical generalization in community ecology. We explore the effect of trophic rank upon the “strength” of the species–area relationship, as measured by z, the slope of a log(species) vs. log(area) plot. We present a simple model for communities closed to immigration, composed of “stacked specialist” food chains (where each plant species supports a specialist herbivore, which in turn sustains a specialist carnivore, etc.), that predicts z should increase with trophic rank; the model brings out some of the spatial implications of sequential dependencies among species. We discuss empirical examples in which the z values of taxa differing in trophic rank were reported and lament the shortage of well-documented examples in the ecological literature. Several examples fit the expected pattern, but others do not. We outline several additional reasons why z values might increase with trophic rank, even for generalists. If the qualitative assumptions of the model are relaxed, the predicted effect of trophic rank on z should weaken or even be reversed. Trophic rank may not have a systematic effect on the species–area relationship if (1) there are strong top-down interactions leading to prey extinctions; (2) communities are open, with recurrent immigration, particularly at higher trophic ranks; (3) consumers are facultative generalists, able to exist on a wide range of resource species; or (4) systems are far from equilibrium. Our aim in this thought piece is to stimulate community ecologists to link theoretical and empirical studies of food web structure with analyses of spatial dynamics and landscape ecology, and to encourage empirical studies of the species–area relationship focused on comparisons across taxa varying in trophic rank.","accessed":{"date-parts":[[2020,2,10]]},"author":[{"family":"Holt","given":"Robert D."},{"family":"Lawton","given":"John H."},{"family":"Polis","given":"Gary A."},{"family":"Martinez","given":"Neo D."}],"container-title":"Ecology","DOI":"10.1890/0012-9658(1999)080[1495:TRATSA]2.0.CO;2","ISSN":"1939-9170","issue":"5","issued":{"date-parts":[[1999]]},"language":"en","page":"1495-1504","source":"Wiley Online Library","title":"Trophic Rank and the Species–Area Relationship","type":"article-journal","URL":"https://esajournals.onlinelibrary.wiley.com/doi/abs/10.1890/0012-9658%281999%29080%5B1495%3ATRATSA%5D2.0.CO%3B2","volume":"80"},
  {"id":"HootHobb15","abstract":"The steady upward trend in the use of model selection and Bayesian methods in ecological research has made it clear that both approaches to inference are important for modern analysis of models and data. However, in teaching Bayesian methods and in working with our research colleagues, we have noticed a general dissatisfaction with the available literature on Bayesian model selection and multimodel inference. Students and researchers new to Bayesian methods quickly find that the published advice on model selection is often preferential in its treatment of options for analysis, frequently advocating one particular method above others. The recent appearance of many articles and textbooks on Bayesian modeling has provided welcome background on relevant approaches to model selection in the Bayesian framework, but most of these are either very narrowly focused in scope or inaccessible to ecologists. Moreover, the methodological details of Bayesian model selection approaches are spread thinly throughout the literature, appearing in journals from many different fields. Our aim with this guide is to condense the large body of literature on Bayesian approaches to model selection and multimodel inference and present it specifically for quantitative ecologists as neutrally as possible. We also bring to light a few important and fundamental concepts relating directly to model selection that seem to have gone unnoticed in the ecological literature. Throughout, we provide only a minimal discussion of philosophy, preferring instead to examine the breadth of approaches as well as their practical advantages and disadvantages. This guide serves as a reference for ecologists using Bayesian methods, so that they can better understand their options and can make an informed choice that is best aligned with their goals for inference.","accessed":{"date-parts":[[2020,2,12]]},"author":[{"family":"Hooten","given":"M. B."},{"family":"Hobbs","given":"N. T."}],"container-title":"Ecological Monographs","DOI":"10.1890/14-0661.1","ISSN":"1557-7015","issue":"1","issued":{"date-parts":[[2015]]},"language":"en","page":"3-28","source":"Wiley Online Library","title":"A guide to Bayesian model selection for ecologists","type":"article-journal","URL":"https://esajournals.onlinelibrary.wiley.com/doi/abs/10.1890/14-0661.1","volume":"85"},
  {"id":"Jord16","abstract":"Pedro Jordano assesses the challenges of studying the functional aspects of species interactions and how basic research is helping us to address the current fast-paced extinction of species due to human activities.","accessed":{"date-parts":[[2016,9,27]]},"author":[{"family":"Jordano","given":"Pedro"}],"container-title":"PLOS Biol","container-title-short":"PLOS Biol","DOI":"10.1371/journal.pbio.1002559","ISSN":"1545-7885","issue":"9","issued":{"date-parts":[[2016,9,15]]},"page":"e1002559","source":"PLoS Journals","title":"Chasing Ecological Interactions","type":"article-journal","URL":"http://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.1002559","volume":"14"},
  {"id":"Jord16a","accessed":{"date-parts":[[2016,10,12]]},"author":[{"family":"Jordano","given":"Pedro"}],"container-title":"Functional Ecology","DOI":"10.1111/1365-2435.12763","ISSN":"02698463","issued":{"date-parts":[[2016,9]]},"language":"en","source":"CrossRef","title":"Sampling networks of ecological interactions","type":"article-journal","URL":"http://doi.wiley.com/10.1111/1365-2435.12763"},
  {"id":"KefiBerl12","author":[{"family":"Kéfi","given":"Sonia"},{"family":"Berlow","given":"Eric L"},{"family":"Wieters","given":"Evie A."},{"family":"Navarrete","given":"Sergio A."},{"family":"Petchey","given":"Owen L."},{"family":"Wood","given":"Spencer A."},{"family":"Boit","given":"Alice"},{"family":"Joppa","given":"Lucas N."},{"family":"Lafferty","given":"Kevin D."},{"family":"Williams","given":"Richard J."},{"family":"Martinez","given":"Neo D."},{"family":"Menge","given":"Bruce"},{"family":"Blanchette","given":"Carol"},{"family":"Iles","given":"Alison C."},{"family":"Brose","given":"Ulrich"}],"container-title":"Ecol. Lett.","DOI":"10.1111/j.1461-0248.2011.01732.x","ISSN":"1461-023X","issued":{"date-parts":[[2012,2]]},"page":"291-300","title":"More than a meal: integrating non-feeding interactions into food webs","type":"article-journal","volume":"15"},
  {"id":"Law79","abstract":"If a predator crops prey of certain ages in preference to others, it may be acting as an agent of selection, causing genetic change in the prey population. This paper adapts a model of life-history evolution to investigate some selective consequences of several patterns of age-specific predation. The model allows allocation of resources to reproduction, growth, and maintenance in an age class i to be varied. Subject to several assumptions, it is shown that increasing predation on individuals younger than i leads to selection for lower rates of reproduction at age i. Conversely, increasing predation on individuals older than and/or equal to i leads to selection for greater rates of reproduction. If individuals from both these age ranges are cropped the optimal rate of reproduction may either increase or decrease. The only circumstance under which no change occurs arises if all individuals irrespective of age are liable to be cropped, or if the effects of predation on younger and older age classes exactly cancel one another. The implications of these results to the management of populations exploited by man are discussed.","accessed":{"date-parts":[[2020,2,9]]},"archive":"JSTOR","author":[{"family":"Law","given":"Richard"}],"container-title":"The American Naturalist","ISSN":"0003-0147","issue":"3","issued":{"date-parts":[[1979]]},"page":"399-417","source":"JSTOR","title":"Optimal Life Histories Under Age-Specific Predation","type":"article-journal","URL":"https://www.jstor.org/stable/2460187","volume":"114"},
  {"id":"Mart92","author":[{"family":"Martinez","given":"Néo D"}],"container-title":"The American Naturalist","issue":"6","issued":{"date-parts":[[1992]]},"page":"1208-1218","title":"Constant Connectance in Community Food Webs","type":"article-journal","URL":"http://www.jstor.org/stable/2462337","volume":"139"},
  {"id":"May72","accessed":{"date-parts":[[2016,2,15]]},"author":[{"family":"May","given":"Robert M."}],"container-title":"Nature","DOI":"10.1038/238413a0","ISSN":"0028-0836","issue":"5364","issued":{"date-parts":[[1972,8,18]]},"page":"413-414","source":"CrossRef","title":"Will a Large Complex System be Stable?","type":"article-journal","URL":"http://www.nature.com/doifinder/10.1038/238413a0","volume":"238"},
  {"id":"McCa07","abstract":"Biodiversity researchers have focused on diversity at the cost of ignoring the networks of interactions between organisms that characterize ecosystems.","author":[{"family":"McCann","given":"Kevin"}],"container-title":"Nature","container-title-short":"Nature","DOI":"10.1038/446029a","ISSN":"0028-0836","issue":"7131","issued":{"date-parts":[[2007,3,1]]},"language":"en","page":"29-29","title":"Protecting biostructure","type":"article-journal","URL":"http://www.nature.com/nature/journal/v446/n7131/full/446029a.html","volume":"446"},
  {"id":"McCa12","author":[{"family":"McCann","given":"Kevin S"}],"issued":{"date-parts":[[2012]]},"publisher":"Princeton University Press","publisher-place":"Princeton","title":"Food webs","type":"book"},
  {"id":"MontPimm06","author":[{"family":"Montoya","given":"José M."},{"family":"Pimm","given":"Stuart L."},{"family":"Solé","given":"Ricard V."}],"container-title":"Nature","DOI":"10.1038/nature04927","issue":"7100","issued":{"date-parts":[[2006,7,20]]},"page":"259-264","title":"Ecological networks and their fragility","type":"article-journal","volume":"442"},
  {"id":"PascDunn06","abstract":"This book is based on proceedings from a February 2004 Santa Fe Institute workshop. Its contributing chapter authors treat the ecology of predator-prey interactions and food web theory, structure, and dynamics, joining researchers who also work on complex systems and on large nonlinear networks from the points of view of other sub-fields within ecology. Food webs play a central role in the debates on the role of complexity in stability, persistence, and resilience. Better empirical data and the exploding interest in the subject of networks across social, physical, and natural sciences prompted creation of this volume. The book explores the boundaries of what is known of the relationship between structure and dynamics in ecological networks and defines directions for future developments in this field.","author":[{"family":"Pascual","given":"Mercedes"},{"family":"Dunne","given":"Jennifer A."}],"ISBN":"978-0-19-518816-5","issued":{"date-parts":[[2006]]},"language":"en","number-of-pages":"405","publisher":"Oxford University Press, USA","source":"Google Books","title":"Ecological Networks: Linking Structure to Dynamics in Food Webs","title-short":"Ecological Networks","type":"book"},
  {"id":"PetcBeck08","accessed":{"date-parts":[[2020,2,18]]},"author":[{"family":"Petchey","given":"O. L."},{"family":"Beckerman","given":"A. P."},{"family":"Riede","given":"J. O."},{"family":"Warren","given":"P. H."}],"container-title":"Proceedings of the National Academy of Sciences","container-title-short":"Proceedings of the National Academy of Sciences","DOI":"10.1073/pnas.0710672105","ISSN":"0027-8424, 1091-6490","issue":"11","issued":{"date-parts":[[2008,3,18]]},"language":"en","page":"4191-4196","source":"DOI.org (Crossref)","title":"Size, foraging, and food web structure","type":"article-journal","URL":"http://www.pnas.org/cgi/doi/10.1073/pnas.0710672105","volume":"105"},
  {"id":"PoisBais16","accessed":{"date-parts":[[2017,1,20]]},"author":[{"family":"Poisot","given":"Timothée"},{"family":"Baiser","given":"Benjamin"},{"family":"Dunne","given":"Jennifer A."},{"family":"Kéfi","given":"Sonia"},{"family":"Massol","given":"François"},{"family":"Mouquet","given":"Nicolas"},{"family":"Romanuk","given":"Tamara N."},{"family":"Stouffer","given":"Daniel B."},{"family":"Wood","given":"Spencer A."},{"family":"Gravel","given":"Dominique"}],"container-title":"Ecography","DOI":"10.1111/ecog.00976","ISSN":"09067590","issue":"4","issued":{"date-parts":[[2016,4]]},"language":"en","page":"384-390","source":"CrossRef","title":"mangal - making ecological network analysis simple","type":"article-journal","URL":"http://doi.wiley.com/10.1111/ecog.00976","volume":"39"},
  {"id":"PoisCirt16","accessed":{"date-parts":[[2016,10,12]]},"author":[{"family":"Poisot","given":"Timothée"},{"family":"Cirtwill","given":"Alyssa R."},{"family":"Cazelles","given":"Kévin"},{"family":"Gravel","given":"Dominique"},{"family":"Fortin","given":"Marie-Josée"},{"family":"Stouffer","given":"Daniel B."}],"container-title":"Methods in Ecology and Evolution","DOI":"10.1111/2041-210X.12468","editor":[{"family":"Vamosi","given":"Jana"}],"ISSN":"2041210X","issue":"3","issued":{"date-parts":[[2016,3]]},"language":"en","page":"303-312","source":"CrossRef","title":"The structure of probabilistic networks","type":"article-journal","URL":"http://doi.wiley.com/10.1111/2041-210X.12468","volume":"7"},
  {"id":"PoisGrav14","abstract":"Connectance and degree distributions are important components of the structure of ecological networks. In this contribution, we use a statistical argument and simple network generating models to show that properties of the degree distribution are driven by network connectance. We discuss the consequences of this finding for (1) the generation of random networks in null-model analyses, and (2) the interpretation of network structure and ecosystem properties in relationship with degree distribution.","accessed":{"date-parts":[[2020,2,5]]},"author":[{"family":"Poisot","given":"Timothée"},{"family":"Gravel","given":"Dominique"}],"container-title":"PeerJ","container-title-short":"PeerJ","DOI":"10.7717/peerj.251","ISSN":"2167-8359","issued":{"date-parts":[[2014,2,4]]},"language":"en","page":"e251","source":"peerj.com","title":"When is an ecological network complex? Connectance drives degree distribution and emerging network properties","title-short":"When is an ecological network complex?","type":"article-journal","URL":"https://peerj.com/articles/251","volume":"2"},
  {"id":"PoisStou15","accessed":{"date-parts":[[2017,2,21]]},"author":[{"family":"Poisot","given":"Timothée"},{"family":"Stouffer","given":"Daniel B."},{"family":"Gravel","given":"Dominique"}],"container-title":"Oikos","DOI":"10.1111/oik.01719","ISSN":"00301299","issue":"3","issued":{"date-parts":[[2015,3]]},"language":"en","page":"243-251","source":"CrossRef","title":"Beyond species: why ecological interaction networks vary through space and time","title-short":"Beyond species","type":"article-journal","URL":"http://doi.wiley.com/10.1111/oik.01719","volume":"124"},
  {"id":"RiedRall10","abstract":"Trophic scaling models describe how topological food-web properties such as the number of predator–prey links scale with species richness of the community. Early models predicted that either the link density (i.e. the number of links per species) or the connectance (i.e. the linkage probability between any pair of species) is constant across communities. More recent analyses, however, suggest that both these scaling models have to be rejected, and we discuss several hypotheses that aim to explain the scale dependence of these complexity parameters. Based on a recent, highly resolved food-web compilation, we analysed the scaling behaviour of 16 topological parameters and found significant power–law scaling relationships with diversity (i.e. species richness) and complexity (i.e. connectance) for most of them. These results illustrate the lack of universal constants in food-web ecology as a function of diversity or complexity. Nonetheless, our power–law scaling relationships suggest that fundamental processes determine food-web topology, and subsequent analyses demonstrated that ecosystem-specific differences in these relationships were of minor importance. As such, these newly described scaling relationships provide robust and testable cornerstones for future structural food-web models.","accessed":{"date-parts":[[2020,2,8]]},"author":[{"family":"Riede","given":"Jens O."},{"family":"Rall","given":"Björn C."},{"family":"Banasek-Richter","given":"Carolin"},{"family":"Navarrete","given":"Sergio A."},{"family":"Wieters","given":"Evie A."},{"family":"Emmerson","given":"Mark C."},{"family":"Jacob","given":"Ute"},{"family":"Brose","given":"Ulrich"}],"collection-title":"Ecological Networks","container-title":"Advances in Ecological Research","DOI":"10.1016/B978-0-12-381363-3.00003-4","editor":[{"family":"Woodward","given":"Guy"}],"issued":{"date-parts":[[2010,1,1]]},"language":"en","page":"139-170","publisher":"Academic Press","source":"ScienceDirect","title":"Chapter 3 - Scaling of Food-Web Properties with Diversity and Complexity Across Ecosystems","type":"chapter","URL":"http://www.sciencedirect.com/science/article/pii/B9780123813633000034","volume":"42"},
  {"id":"SeibCado18","accessed":{"date-parts":[[2018,10,26]]},"author":[{"family":"Seibold","given":"Sebastian"},{"family":"Cadotte","given":"Marc W."},{"family":"MacIvor","given":"J. Scott"},{"family":"Thorn","given":"Simon"},{"family":"Müller","given":"Jörg"}],"container-title":"Trends in Ecology & Evolution","container-title-short":"Trends in Ecology & Evolution","DOI":"10.1016/j.tree.2018.07.001","ISSN":"0169-5347","issue":"10","issued":{"date-parts":[[2018,10,1]]},"language":"English","page":"754-764","PMID":"30146326","source":"www.cell.com","title":"The Necessity of Multitrophic Approaches in Community Ecology","type":"article-journal","URL":"https://www.cell.com/trends/ecology-evolution/abstract/S0169-5347(18)30147-2","volume":"33"},
  {"id":"SmitMoor16","abstract":"Biological invasions are a key component of global change, and understanding the drivers of global invasion patterns will aid in assessing and mitigating the impact of invasive species. While invasive species are most often studied in the context of one or two trophic levels, in reality species invade communities comprised of complex food webs. The complexity and integrity of the native food web may be a more important determinant of invasion success than the strength of interactions between a small subset of species within a larger food web. Previous efforts to understand the relationship between food web properties and species invasions have been primarily theoretical and have yielded mixed results. Here, we present a synthesis of empirical information on food web connectance and species invasion success gathered from different sources (estimates of food web connectance from the primary literature and estimates of invasion success from the Global Invasive Species Database as well as the primary literature). Our results suggest that higher-connectance food webs tend to host fewer invaders and exert stronger biotic resistance compared to low-connectance webs. We argue that while these correlations cannot be used to infer a causal link between food web connectance and habitat invasibility, the promising findings beg for further empirical research that deliberately tests for relationships between food web connectance and invasion. This article is protected by copyright. All rights reserved.","accessed":{"date-parts":[[2016,9,1]]},"author":[{"family":"Smith-Ramesh","given":"Lauren M."},{"family":"Moore","given":"Alexandria C."},{"family":"Schmitz","given":"Oswald J."}],"container-title":"Global Change Biology","container-title-short":"Glob Change Biol","DOI":"10.1111/gcb.13460","ISSN":"1365-2486","issued":{"date-parts":[[2016,8,1]]},"language":"en","page":"n/a-n/a","source":"Wiley Online Library","title":"Global synthesis suggests that food web connectance correlates to invasion resistance","type":"article-journal","URL":"http://onlinelibrary.wiley.com/doi/10.1111/gcb.13460/abstract"},
  {"id":"TakMorr17","abstract":"A Beta-Binomial-Logit model is a Beta-Binomial model with covariate information incorporated via a logistic regression. Posterior propriety of a Bayesian Beta-Binomial-Logit model can be data-dependent for improper hyper-prior distributions. Various researchers in the literature have unknowingly used improper posterior distributions or have given incorrect statements about posterior propriety because checking posterior propriety can be challenging due to the complicated functional form of a Beta-Binomial-Logit model. We derive data-dependent necessary and sufficient conditions for posterior propriety within a class of hyper-prior distributions that encompass those used in previous studies. When a posterior is improper due to improper hyper-prior distributions, we suggest using proper hyper-prior distributions that can mimic the behaviors of improper choices.","accessed":{"date-parts":[[2020,2,8]]},"author":[{"family":"Tak","given":"Hyungsuk"},{"family":"Morris","given":"Carl N."}],"container-title":"Bayesian Analysis","container-title-short":"Bayesian Anal.","DOI":"10.1214/16-BA1012","ISSN":"1936-0975, 1931-6690","issue":"2","issued":{"date-parts":[[2017,6]]},"language":"EN","page":"533-555","source":"Project Euclid","title":"Data-Dependent Posterior Propriety of a Bayesian Beta-Binomial-Logit Model","type":"article-journal","URL":"https://projecteuclid.org/euclid.ba/1469021382","volume":"12"},
  {"id":"ThomBros12","author":[{"family":"Thompson","given":"Ross M."},{"family":"Brose","given":"Ulrich"},{"family":"Dunne","given":"Jennifer A."},{"family":"Hall","given":"Robert O."},{"family":"Hladyz","given":"Sally"},{"family":"Kitching","given":"Roger L."},{"family":"Martinez","given":"Neo D."},{"family":"Rantala","given":"Heidi"},{"family":"Romanuk","given":"Tamara N."},{"family":"Stouffer","given":"Daniel B."},{"family":"Tylianakis","given":"Jason M."}],"container-title":"Trends in Ecology & Evolution","DOI":"10.1016/j.tree.2012.08.005","issue":"12","issued":{"date-parts":[[2012,12]]},"page":"689-697","title":"Food webs: reconciling the structure and function of biodiversity","type":"article-journal","volume":"27"},
  {"id":"VehtGelm17","abstract":"Leave-one-out cross-validation (LOO) and the widely applicable information criterion (WAIC) are methods for estimating pointwise out-of-sample prediction accuracy from a fitted Bayesian model using the log-likelihood evaluated at the posterior simulations of the parameter values. LOO and WAIC have various advantages over simpler estimates of predictive error such as AIC and DIC but are less used in practice because they involve additional computational steps. Here we lay out fast and stable computations for LOO and WAIC that can be performed using existing simulation draws. We introduce an efficient computation of LOO using Pareto-smoothed importance sampling (PSIS), a new procedure for regularizing importance weights. Although WAIC is asymptotically equal to LOO, we demonstrate that PSIS-LOO is more robust in the finite case with weak priors or influential observations. As a byproduct of our calculations, we also obtain approximate standard errors for estimated predictive errors and for comparison of predictive errors between two models. We implement the computations in an R package called loo and demonstrate using models fit with the Bayesian inference package Stan.","accessed":{"date-parts":[[2020,2,11]]},"author":[{"family":"Vehtari","given":"Aki"},{"family":"Gelman","given":"Andrew"},{"family":"Gabry","given":"Jonah"}],"container-title":"Statistics and Computing","container-title-short":"Stat Comput","DOI":"10.1007/s11222-016-9696-4","ISSN":"1573-1375","issue":"5","issued":{"date-parts":[[2017,9,1]]},"language":"en","page":"1413-1432","source":"Springer Link","title":"Practical Bayesian model evaluation using leave-one-out cross-validation and WAIC","type":"article-journal","URL":"https://doi.org/10.1007/s11222-016-9696-4","volume":"27"},
  {"id":"VieiAlme15","abstract":"Understanding and predicting species extinctions and coextinctions is a major goal of ecological research in the face of a biodiversity crisis. Typically, models based on network topology are used to simulate coextinctions in mutualistic networks. However, such topological models neglect two key biological features of species interactions: variation in the intrinsic dependence of species on the mutualism, and variation in the relative importance of each interacting partner. By incorporating both types of variation, we developed a stochastic coextinction model capable of simulating extinction cascades far more complex than those observed in previous topological models. Using a set of empirical mutualistic networks, we show that the traditional topological model may either underestimate or overestimate the number and likelihood of coextinctions, depending on the intrinsic dependence of species on the mutualism. More importantly, contrary to topological models, our stochastic model predicts extinction cascades to be more likely in highly connected mutualistic communities.","accessed":{"date-parts":[[2020,2,5]]},"author":[{"family":"Vieira","given":"Marcos Costa"},{"family":"Almeida‐Neto","given":"Mário"}],"container-title":"Ecology Letters","DOI":"10.1111/ele.12394","ISSN":"1461-0248","issue":"2","issued":{"date-parts":[[2015]]},"language":"en","page":"144-152","source":"Wiley Online Library","title":"A simple stochastic model for complex coextinctions in mutualistic networks: robustness decreases with connectance","title-short":"A simple stochastic model for complex coextinctions in mutualistic networks","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1111/ele.12394","volume":"18"},
  {"id":"WillGast01","abstract":"Aim To attack a widespread myth. Location World-wide. Methods Simple mathematical logical and empirical examples. Results As both species and area are finite and non-negative, the species–area relationship is limited at both ends. The log species–log area relationship is normally effectively linear on scales from about 1 ha to 107 km2. There are no asymptotes. At the intercontinental scale it may get steeper; at small scales it may in different cases get steeper or shallower or maintain its slope. Main conclusion The species–area relationship does not have an asymptote.","accessed":{"date-parts":[[2020,2,10]]},"author":[{"family":"Williamson","given":"Mark"},{"family":"Gaston","given":"Kevin J."},{"family":"Lonsdale","given":"W. M."}],"container-title":"Journal of Biogeography","DOI":"10.1046/j.1365-2699.2001.00603.x","ISSN":"1365-2699","issue":"7","issued":{"date-parts":[[2001]]},"language":"en","page":"827-830","source":"Wiley Online Library","title":"The species–area relationship does not have an asymptote!","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1046/j.1365-2699.2001.00603.x","volume":"28"},
  {"id":"WillMart00","accessed":{"date-parts":[[2018,2,14]]},"author":[{"family":"Williams","given":"Richard J."},{"family":"Martinez","given":"Neo D."}],"container-title":"Nature","DOI":"10.1038/35004572","ISSN":"0028-0836, 1476-4687","issue":"6774","issued":{"date-parts":[[2000,3]]},"language":"en","page":"180-183","source":"CrossRef","title":"Simple rules yield complex food webs","type":"article-journal","URL":"http://www.nature.com/articles/35004572","volume":"404"},
  {"id":"WillMart04","abstract":"While trophic levels have found broad application throughout ecology, they are also in much contention on analytical and empirical grounds. Here, we use a new generation of data and theory to examine long‐standing questions about trophic‐level limits and degrees of omnivory. The data include food webs of the Chesapeake Bay, U.S.A., the island of Saint Martin, a U.K. grassland, and a Florida seagrass community, which appear to be the most trophically complete food webs available in the primary literature due to their inclusion of autotrophs and empirically derived estimates of the relative energetic contributions of each trophic link. We show that most (54%) of the 212 species in the four food webs can be unambiguously assigned to a discrete trophic level. Omnivory among the remaining species appears to be quite limited, as judged by the standard deviation of omnivores’ energy‐weighted food‐chain lengths. This allows simple algorithms based on binary food webs without energetic details to yield surprisingly accurate estimates of species’ trophic and omnivory levels. While maximum trophic levels may plausibly exceed historically asserted limits, our analyses contradict both recent empirical claims that these limits are exceeded and recent theoretical claims that rampant omnivory eliminates the scientific utility of the trophic‐level concept.","accessed":{"date-parts":[[2019,11,8]]},"author":[{"family":"Williams","given":"Richard J."},{"family":"Martinez","given":"Neo D."}],"container-title":"The American Naturalist","container-title-short":"The American Naturalist","DOI":"10.1086/381964","ISSN":"0003-0147","issue":"3","issued":{"date-parts":[[2004,3,1]]},"page":"458-468","source":"journals.uchicago.edu (Atypon)","title":"Limits to Trophic Levels and Omnivory in Complex Food Webs: Theory and Data.","title-short":"Limits to Trophic Levels and Omnivory in Complex Food Webs","type":"article-journal","URL":"https://www.journals.uchicago.edu/doi/abs/10.1086/381964","volume":"163"},
  {"id":"WinePian01","accessed":{"date-parts":[[2020,2,8]]},"author":[{"family":"Winemiller","given":"Kirk O."},{"family":"Pianka","given":"Eric R."},{"family":"Vitt","given":"Laurie J."},{"family":"Joern","given":"Anthony"}],"container-title":"The American Naturalist","container-title-short":"The American Naturalist","DOI":"10.1086/321315","ISSN":"0003-0147","issue":"2","issued":{"date-parts":[[2001,8,1]]},"page":"193-199","source":"journals.uchicago.edu (Atypon)","title":"Food Web Laws or Niche Theory? Six Independent Empirical Tests.","title-short":"Food Web Laws or Niche Theory?","type":"article-journal","URL":"https://www.journals.uchicago.edu/doi/abs/10.1086/321315","volume":"158"},
  {"id":"WoodRuss15","abstract":"This study asks whether the spatial scale of sampling alters structural properties of food webs and whether any differences are attributable to changes in species richness and connectance with scale. Understanding how different aspects of sampling effort affect ecological network structure is important for both fundamental ecological knowledge and the application of network analysis in conservation and management. Using a highly resolved food web for the marine intertidal ecosystem of the Sanak Archipelago in the Eastern Aleutian Islands, Alaska, we assess how commonly studied properties of network structure differ for 281 versions of the food web sampled at five levels of spatial scale representing six orders of magnitude in area spread across the archipelago. Species (S) and link (L) richness both increased by approximately one order of magnitude across the five spatial scales. Links per species (L/S) more than doubled, while connectance (C) decreased by approximately two-thirds. Fourteen commonly studied properties of network structure varied systematically with spatial scale of sampling, some increasing and others decreasing. While ecological network properties varied systematically with sampling extent, analyses using the niche model and a power-law scaling relationship indicate that for many properties, this apparent sensitivity is attributable to the increasing S and decreasing C of webs with increasing spatial scale. As long as effects of S and C are accounted for, areal sampling bias does not have a special impact on our understanding of many aspects of network structure. However, attention does need be paid to some properties such as the fraction of species in loops, which increases more than expected with greater spatial scales of sampling.","accessed":{"date-parts":[[2019,3,14]]},"author":[{"family":"Wood","given":"Spencer A."},{"family":"Russell","given":"Roly"},{"family":"Hanson","given":"Dieta"},{"family":"Williams","given":"Richard J."},{"family":"Dunne","given":"Jennifer A."}],"container-title":"Ecology and Evolution","DOI":"10.1002/ece3.1640","ISSN":"2045-7758","issue":"17","issued":{"date-parts":[[2015]]},"language":"en","page":"3769-3782","source":"Wiley Online Library","title":"Effects of spatial scale of sampling on food web structure","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1002/ece3.1640","volume":"5"}
]
